app/views/resources/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."resource_id" = ?  [["resource_id", 1]]
---
<b>Tags :   </b>
<%= raw @resource.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %>