app/controllers/comments_controller.rb

  def create
    @resource = Resource.find(params[:resource_id])
    @comment = @resource.comments.create(comment_params)
---
SELECT  "resources".* FROM "resources"  WHERE "resources"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "resource_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "ddsg"], ["created_at", "2014-06-03 14:02:01.144383"], ["resource_id", 2], ["updated_at", "2014-06-03 14:02:01.144383"]]