app/controllers/resources_controller.rb

  def index
    if params[:tag]
     @resources = Resource.tagged_with(params[:tag])
    else
     @resources = Resource.all
---
SELECT "resources".* FROM "resources" INNER JOIN "taggings" ON "resources"."id" = "taggings"."resource_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."resource_id" = ?  [["resource_id", 1]]

  def show
	@resource = Resource.find(params[:id])
---
SELECT  "resources".* FROM "resources"  WHERE "resources"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @resource = Resource.new(resource_params)

    if @resource.save
---
INSERT INTO "resources" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-05-19 06:06:09.100348"], ["updated_at", "2014-05-19 06:06:09.100348"]]