app/controllers/tags_controller.rb

SELECT "resources".* FROM "resources"
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."resource_id" = $1  [["resource_id", 1]]
---
 def index
    if params[:tag]
     @resources = Resource.tagged_with(params[:tag])
    else
     @resources = Resource.all